{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "3722b3a2",
   "metadata": {},
   "source": [
    "# Graph Data dase representation: First scenario:"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0913c93d",
   "metadata": {},
   "source": [
    "Now we have a csv file that contains all realtionships that in each usecase, and the next step is to make a graph database representation usin the neo4j AURA DB, by using its query language `Cypher` with its interface with python to automate the operation of Creating and editing the reationships."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "19cbb663",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "chmod: cannot access 'neo4j-desktop-1.4.15-x86_64.AppImage': No such file or directory\r\n",
      "/bin/bash: ./neo4j-desktop-1.4.15-x86_64.AppImage: No such file or directory\r\n"
     ]
    }
   ],
   "source": [
    "# Start neo4j \n",
    "!chmod a+x neo4j-desktop-1.4.15-x86_64.AppImage; ./neo4j-desktop-1.4.15-x86_64.AppImage"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 131,
   "id": "1651a3d1",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "from neo4j import GraphDatabase\n",
    "import logging\n",
    "from neo4j.exceptions import ServiceUnavailable"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5e3941c7",
   "metadata": {},
   "source": [
    "## Importing CSV realtionship file and Editing the components names:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "4865a726",
   "metadata": {},
   "outputs": [],
   "source": [
    "relations = pd.read_csv(\"./figure_parse.csv\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f5b97fe9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>source</th>\n",
       "      <th>target</th>\n",
       "      <th>message</th>\n",
       "      <th>class</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Knowledge base</td>\n",
       "      <td>AN component-N</td>\n",
       "      <td>exchange of knowledge</td>\n",
       "      <td>critical relationship</td>\n",
       "      <td>UC001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>AN Component-1</td>\n",
       "      <td>AN component-N</td>\n",
       "      <td>exchange of knowledge</td>\n",
       "      <td>critical relationship</td>\n",
       "      <td>UC001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Knowledge base</td>\n",
       "      <td>AN Component-1</td>\n",
       "      <td>Report</td>\n",
       "      <td>critical relationship</td>\n",
       "      <td>UC001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Knowledge base</td>\n",
       "      <td>AN Component-1</td>\n",
       "      <td>exchange of knowledge</td>\n",
       "      <td>critical relationship</td>\n",
       "      <td>UC001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Management domain</td>\n",
       "      <td>Knowledge base</td>\n",
       "      <td>import of knowledge</td>\n",
       "      <td>critical relationship</td>\n",
       "      <td>UC001</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "              source          target                message  \\\n",
       "0     Knowledge base  AN component-N  exchange of knowledge   \n",
       "1     AN Component-1  AN component-N  exchange of knowledge   \n",
       "2     Knowledge base  AN Component-1                 Report   \n",
       "3     Knowledge base  AN Component-1  exchange of knowledge   \n",
       "4  Management domain  Knowledge base    import of knowledge   \n",
       "\n",
       "                   class     id  \n",
       "0  critical relationship  UC001  \n",
       "1  critical relationship  UC001  \n",
       "2  critical relationship  UC001  \n",
       "3  critical relationship  UC001  \n",
       "4  critical relationship  UC001  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "relations.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8c692da",
   "metadata": {},
   "source": [
    "After we Saw the tablem we have found some inconsitancy in names of components, and after that we have the following inconvience:\n",
    "- \"Sandbox\" -> \"AN Sandbox\",\n",
    "- \"Sandbox environment\" -> \"AN Sandbox\",\n",
    "- \"Industry vertical solution providers\" -> \"Industry vertical solution provider\",\n",
    "- \"Closed loops\" -> \"Controller\",\n",
    "- \"Closed loop automation frameworks\" -> \"CL automation framework\",\n",
    "- \"Control loop\" -> \"Controller\",\n",
    "- \"Control loop app store(public)\" -> \"Controller repository\",\n",
    "- \"Control loop designer\" -> \"Controller designer\",\n",
    "- \"REx:: AN Orchestrator\" -> \"AN orchestrator\",\n",
    "- \"AN Orchestrator\" -> \"AN orchestrator\",\n",
    "- \"AN component-1\" -> \"AN Component-1\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "3962f766",
   "metadata": {},
   "outputs": [],
   "source": [
    "edits = {\n",
    "    \"Sandbox\":\"AN Sandbox\",\n",
    "    \"Sandbox environment\":\"AN Sandbox\",\n",
    "    \"Industry vertical solution providers\":\"Industry vertical solution provider\",\n",
    "    \"Closed loops\":\"Controller\",\n",
    "    \"Closed loop automation frameworks\":\"CL automation framework\",\n",
    "    \"Control loop\":\"Controller\",\n",
    "    \"Control loop app store(public)\":\"Controller repository\",\n",
    "    \"Control loop designer\":\"Controller designer\",\n",
    "    \"REx:: AN Orchestrator\":\"AN orchestrator\",\n",
    "    \"AN Orchestrator\":\"AN orchestrator\",\n",
    "    \"AN component-1\": \"AN Component-1\"\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "c81f4a55",
   "metadata": {},
   "outputs": [],
   "source": [
    "for key in edits:\n",
    "    relations.loc[relations.source == key, \"source\"] = edits[key]\n",
    "    relations.loc[relations.target == key, \"target\"] = edits[key]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "ff60b0f9",
   "metadata": {},
   "outputs": [],
   "source": [
    "sources = list(relations.source.unique())\n",
    "targets = list(relations.target.unique())\n",
    "all_ = sources + targets\n",
    "components = set(np.array(all_).flatten())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "1f12de0b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "45"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(components)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "70edf961",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'3rd party developer',\n",
       " 'AN',\n",
       " 'AN Component-1',\n",
       " 'AN Sandbox',\n",
       " 'AN component-2|human',\n",
       " 'AN component-N',\n",
       " 'AN orchestrator',\n",
       " 'AN_1',\n",
       " 'AN_2',\n",
       " 'AN_3',\n",
       " 'Anatomy engine',\n",
       " 'BS1',\n",
       " 'BS2',\n",
       " 'BS3',\n",
       " 'BS4',\n",
       " 'Backend',\n",
       " 'CL automation framework',\n",
       " 'Controller',\n",
       " 'Controller designer',\n",
       " 'Controller repository',\n",
       " 'Deployment manager',\n",
       " 'End-user communities',\n",
       " 'Ex manager',\n",
       " 'FLAML controller',\n",
       " 'Industry vertical applications',\n",
       " 'Industry vertical applications @ edge',\n",
       " 'Industry vertical solution provider',\n",
       " 'Intelligent AR app\\n(Glasses)',\n",
       " 'Intelligent maintenance assistance system',\n",
       " 'Inventory systems',\n",
       " 'Knowledge base',\n",
       " 'ML layer',\n",
       " 'Management domain',\n",
       " 'NAO',\n",
       " 'NAO @ edge',\n",
       " 'Network service outside the domain',\n",
       " 'Network service within domain',\n",
       " 'Network services',\n",
       " 'OpenCN (repo)',\n",
       " 'Operations team',\n",
       " 'Private 5G deployment @ edge',\n",
       " 'Service LCM',\n",
       " 'Workflow manager',\n",
       " 'Workflow mediator',\n",
       " 'human'}"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "components"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aceca56e",
   "metadata": {},
   "source": [
    "# REF Code with added link prediction functions:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "463eaed4",
   "metadata": {},
   "outputs": [],
   "source": [
    "class App:\n",
    "\n",
    "    def __init__(self, uri, user, password):\n",
    "        self.driver = GraphDatabase.driver(uri, auth=(user, password))\n",
    "\n",
    "    def close(self):\n",
    "        # Don't forget to close the driver connection when you are finished with it\n",
    "        self.driver.close()\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: uses labels instead of properties\n",
    "    #Vishnu: 1 Aug 2022: Invariant: only 1 actor with 1 name.\n",
    "    #        (Note that rel still uses properties and not labels)\n",
    "    def create_node_with_usecase_label(self, actor_name, usecase_id):\n",
    "        with self.driver.session() as session:\n",
    "            node_already_exists = session.read_transaction(\n",
    "                self._find_and_return_existing_node_label, actor_name)\n",
    "            if not node_already_exists:  \n",
    "                #node itself doesnt exist (not to mention the use case label), Lets add.\n",
    "                result = session.write_transaction(\n",
    "                    self._create_and_return_node_label, actor_name, usecase_id)\n",
    "                for row in result:\n",
    "                    print(\"Created node: {n1}\".format(n1=row['n1name']))\n",
    "            else:\n",
    "                for row in node_already_exists:\n",
    "                    print(\"Node already exists: {name} in {usecase}\".format(name=row['n1name'], \n",
    "                                                                 usecase=row['n1usecase']))\n",
    "                    if not (usecase_id in row['n1usecase']):\n",
    "                      print(\"adding label \"\n",
    "                                +usecase_id+ \n",
    "                                \" in addition to {usecase}\".format(usecase=row['n1usecase']))\n",
    "                      result = session.write_transaction(\n",
    "                                self._add_usecase_and_return_existing_node_label, actor_name, usecase_id)\n",
    "                    else:\n",
    "                      print(\"ignoring ...\")\n",
    "                    #row has only 1 entry due to invariant. So break here. and exit f()\n",
    "                    break\n",
    "    \n",
    "    #Vishnu: 1 Aug 2022: created this f() to query nodes based on a name\n",
    "    #                    and return with usecase labels\n",
    "    @staticmethod\n",
    "    def _find_and_return_existing_node_label(tx, actor_name):\n",
    "        query = (\n",
    "            \"MATCH (n1) \"\n",
    "            \"WHERE (n1.name ='\" + actor_name + \"') \"\n",
    "            \"RETURN n1.name as n1name, labels(n1) as n1usecase\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        try:\n",
    "            return [{\"n1name\": row[\"n1name\"],\"n1usecase\": row[\"n1usecase\"]} \n",
    "                    for row in result]\n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: created this f() to create nodes with usecase label\n",
    "    @staticmethod\n",
    "    def _create_and_return_node_label(tx, actor_name, usecase_id):\n",
    "            query = (\n",
    "            \"CREATE (n1 :\" + usecase_id + \" { name: '\" + actor_name + \"'}) \"\n",
    "            \"RETURN n1\"\n",
    "            )\n",
    "            result = tx.run(query, actor_name=actor_name)\n",
    "            try:\n",
    "                return [{\"n1name\": row[\"n1\"][\"name\"]}\n",
    "                        for row in result]\n",
    "            # Capture any errors along with the query and data for traceability\n",
    "            except ServiceUnavailable as exception:\n",
    "                logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                    query=query, exception=exception))\n",
    "                raise\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: created this f() to add use case labels to existing nodes\n",
    "    #                    Note that the existing labels are left there.\n",
    "    @staticmethod\n",
    "    def _add_usecase_and_return_existing_node_label(tx, actor_name, usecase_id):\n",
    "        query = (\n",
    "            \"MATCH \"\n",
    "            \"(n1) \"\n",
    "            \"WHERE n1.name = '\" + actor_name +\"' \"\n",
    "            \"set n1 :\" + usecase_id +\" \"\n",
    "            \"return n1\"\n",
    "        )\n",
    "        result = tx.run(query, actor_name=actor_name)\n",
    "        try:\n",
    "            return [{\"n1\": row[\"n1\"][\"name\"]}\n",
    "                    for row in result]\n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: created this f() to return all use case actors based on labels\n",
    "    #                    as against properties\n",
    "    @staticmethod\n",
    "    def _find_and_return_all_usecase_actors_label(tx, usecase_id):\n",
    "        query = (\n",
    "            \"MATCH (n) \"\n",
    "            \"WHERE '\" +usecase_id+ \"' in labels(n) \"\n",
    "            \"RETURN n.name AS name\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        return [row[\"name\"] for row in result]\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: created this f() to list all nodes with usecase label\n",
    "    #                    instead of properties\n",
    "    def find_all_usecase_actors_label(self, usecase_id):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.read_transaction(self._find_and_return_all_usecase_actors_label, usecase_id)\n",
    "            i=0\n",
    "            for row in result:\n",
    "                i=i+1\n",
    "                print(\"Found actor-\"+ str(i) +\": {row}\".format(row=row))\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: Created to use label for use case.\n",
    "    #CAUTION: Assumes that actors already exists with label as use case.\n",
    "    #So, this has to be called only in conjunction with create_node_with_usecase\n",
    "    #otherwise you may end up with actors not having use case prop\n",
    "    #but rels will have use case prop. not a good idea.\n",
    "    def create_rel_with_usecase_label(self, actor1_name, rel_name, actor2_name, usecase_id):\n",
    "        with self.driver.session() as session:\n",
    "            this_rel_already_exists = session.read_transaction(\n",
    "                self._find_and_return_this_existing_rels, actor1_name, rel_name, actor2_name, usecase_id)\n",
    "            if (this_rel_already_exists):\n",
    "                print(rel_name + \" already exists with \"+ usecase_id + \" between \"+ actor1_name + \" and \"+ actor2_name)\n",
    "                return\n",
    "            else:\n",
    "                #we are pretty sure something didnt match\n",
    "                #this relation does not exist currently between the nodes under the use case, \n",
    "                #add it.\n",
    "                result3 = session.write_transaction(\n",
    "                    self._create_and_return_rel_label, actor1_name, rel_name, actor2_name, usecase_id)\n",
    "                #if (not retult3)\n",
    "                for row in result3:\n",
    "                    print(\"Created relation: {actor1} - {rel} - {actor2} in {usecase}\".\n",
    "                            format(actor1=row['n1name'], \n",
    "                            rel=row['r1name'],\n",
    "                            actor2=row['n2name'],\n",
    "                            usecase=row['r1usecase']))\n",
    "\n",
    "    #Vishnu: 1 Aug 2022 \n",
    "    #assumption: nodes already exist\n",
    "    #modified from _create_and_return_rel to use labels for n.usecase\n",
    "    @staticmethod\n",
    "    def _create_and_return_rel_label(tx, actor1_name, rel_name, actor2_name, usecaseid):\n",
    "            query = (\n",
    "            \"MATCH \"\n",
    "            \"(n1), \"\n",
    "            \"(n2) \"\n",
    "            \"WHERE n1.name = '\" + actor1_name + \"' AND n2.name = '\"+actor2_name+\"' \"\n",
    "            \" AND '\"+ usecaseid+\"' in labels(n1) \"\n",
    "            \" AND '\"+ usecaseid+\"' in labels(n2) \"\n",
    "            \"CREATE (n1)-[r1:Relation \" + \"{name: '\"+rel_name+\"', usecase: '\"+usecaseid+\"'} ]->(n2) \"\n",
    "            \"RETURN n1, r1, n2\"\n",
    "            )\n",
    "            result = tx.run(query)\n",
    "            try:\n",
    "                return [{\"n1name\": row[\"n1\"][\"name\"], \n",
    "                        \"r1name\": row[\"r1\"][\"name\"],\n",
    "                        \"n2name\": row[\"n2\"][\"name\"],\n",
    "                        \"r1usecase\": row[\"r1\"][\"usecase\"]}\n",
    "                        for row in result]\n",
    "            # Capture any errors along with the query and data for traceability\n",
    "            except ServiceUnavailable as exception:\n",
    "                logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                    query=query, exception=exception))\n",
    "                raise\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: This approach uses properties instead of labels for n.usecases.\n",
    "    #Vishnu: 1 Aug 2022: Invariant: only 1 actor with 1 name.\n",
    "    #Vishnu: 22 Jun 2022: refactored, uses properties instead of labels\n",
    "    #Vishnu: 1 Jun 2022: created this f() to create nodes with usecase label\n",
    "    #Vishnu: 2 Jun 2022: added- check if it already exists.\n",
    "    #Vishnu: 2 Jun 2022: added- check the usecase duplication, adds a usecase if it doesnt exist.\n",
    "    #otherwise ignores the command.\n",
    "    def create_node_with_usecase(self, actor_name, usecase_id):\n",
    "        with self.driver.session() as session:\n",
    "            node_already_exists = session.read_transaction(\n",
    "                self._find_and_return_existing_node, actor_name)\n",
    "            if not node_already_exists:  \n",
    "                result = session.write_transaction(\n",
    "                    self._create_and_return_node, actor_name, usecase_id)\n",
    "                for row in result:\n",
    "                    print(\"Created node: {n1}\".format(n1=row['n1name']))\n",
    "            else:\n",
    "                for row in node_already_exists:\n",
    "                    print(\"Node already exists: {name} in {usecase}\".format(name=row['n1name'], \n",
    "                                                                 usecase=row['n1usecase']))\n",
    "                    s=row['n1usecase'].split(',')\n",
    "                    if not (usecase_id in s):\n",
    "                      print(\"adding prop \"+usecase_id+ \" in addition to \"+row['n1usecase'])\n",
    "                      result = session.write_transaction(\n",
    "                                self._add_usecase_and_return_existing_node, actor_name, usecase_id)\n",
    "                    else:\n",
    "                      print(\"ignoring ...\")\n",
    "                    #row has only 1 entry due to invariant. So break here. and exit f()\n",
    "                    break\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: This approach uses properties instead of labels for usecases.\n",
    "    #Vishnu: 2 Jun 2022: created this f() to query nodes and return with usecase prop\n",
    "    @staticmethod\n",
    "    def _find_and_return_existing_node(tx, actor_name):\n",
    "        query = (\n",
    "            \"MATCH (n1) \"\n",
    "            \"WHERE (n1.name ='\" + actor_name + \"') \"\n",
    "            \"RETURN n1.name as n1name, n1.usecase as n1usecase\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        try:\n",
    "            return [{\"n1name\": row[\"n1name\"],\"n1usecase\": row[\"n1usecase\"]} \n",
    "                    for row in result]\n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: This approach uses properties instead of labels for usecases.\n",
    "    @staticmethod\n",
    "    def _create_and_return_node(tx, actor_name, usecase_id):\n",
    "            query = (\n",
    "            \"CREATE (n1 \"+\"{ name: '\"+actor_name+\"', usecase: '\"+usecase_id+\"'}) \"\n",
    "            \"RETURN n1\"\n",
    "            )\n",
    "            result = tx.run(query, actor_name=actor_name)\n",
    "            try:\n",
    "                return [{\"n1name\": row[\"n1\"][\"name\"]}\n",
    "                        for row in result]\n",
    "            # Capture any errors along with the query and data for traceability\n",
    "            except ServiceUnavailable as exception:\n",
    "                logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                    query=query, exception=exception))\n",
    "                raise\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: This approach uses properties instead of labels for usecases.\n",
    "    #Vishnu: 1 Jun 2022: created this f() to add use case prop to existing nodes \n",
    "    #CAUTION: does not check for duplication, use create_node_with_prop instead.\n",
    "    def add_usecase_existing_node(self, actor_name, usecase_id):\n",
    "        with self.driver.session() as session:\n",
    "            # Write transactions allow the driver to handle retries and transient errors\n",
    "            result = session.write_transaction(\n",
    "                self._add_usecase_and_return_existing_node, actor_name, usecase_id)\n",
    "            \n",
    "            # we expect only 1 node. Do we need the for loop below?\n",
    "            for row in result:\n",
    "                print(\"added usecase to node: {n1}\".format(n1=row['n1']))\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: This approach uses properties instead of labels for usecases.\n",
    "    @staticmethod\n",
    "    def _add_usecase_and_return_existing_node(tx, actor_name, usecase_id):\n",
    "        # To learn more about the Cypher syntax, see https://neo4j.com/docs/cypher-manual/current/\n",
    "        # The Reference Card is also a good resource for keywords https://neo4j.com/docs/cypher-refcard/current/\n",
    "        query = (\n",
    "            \"MATCH \"\n",
    "            \"(n1) \"\n",
    "            \"WHERE n1.name = '\" + actor_name +\"' \"\n",
    "            \"set n1.usecase = n1.usecase + '\" + \",\" + \"'\"+ \"+ '\"+usecase_id +\"' \"\n",
    "            \"return n1\"\n",
    "        )\n",
    "        result = tx.run(query, actor_name=actor_name)\n",
    "        try:\n",
    "            return [{\"n1\": row[\"n1\"][\"name\"]}\n",
    "                    for row in result]\n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "\n",
    "    #Vishnu: 1 Aug 2022: This approach uses properties instead of labels for usecases.\n",
    "    #CAUTION: Assumes that actors already exists with property as n.use case.\n",
    "    #So, this has to be called only in conjunction with create_node_with_usecase\n",
    "    #otherwise you may end up with actors not having use case prop\n",
    "    #but rels will have use case prop. not a good idea.\n",
    "    def create_rel_with_usecase(self, actor1_name, rel_name, actor2_name, usecase_id):\n",
    "        with self.driver.session() as session:\n",
    "            this_rel_already_exists = session.read_transaction(\n",
    "                self._find_and_return_this_existing_rels, actor1_name, rel_name, actor2_name, usecase_id)\n",
    "            if (this_rel_already_exists):\n",
    "                print(rel_name + \" already exists with \"+ usecase_id + \" between \"+ actor1_name + \" and \"+ actor2_name)\n",
    "                return\n",
    "            else:\n",
    "                #we are pretty sure something didnt match\n",
    "                #this relation does not exist currently between the nodes under the use case, \n",
    "                #add it.\n",
    "                result3 = session.write_transaction(\n",
    "                    self._create_and_return_rel, actor1_name, rel_name, actor2_name, usecase_id)\n",
    "                #if (not retult3)\n",
    "                for row in result3:\n",
    "                    print(\"Created relation: {actor1} - {rel} - {actor2} in {usecase}\".\n",
    "                            format(actor1=row['n1name'], \n",
    "                            rel=row['r1name'],\n",
    "                            actor2=row['n2name'],\n",
    "                            usecase=row['r1usecase']))\n",
    "    \n",
    "    #Vishnu: 1 Aug 2022: at this moment this f() uses labels instead of properties for n.usecases.\n",
    "    #                    Note that rels still uses properties.\n",
    "    #        1 Aug 2022: TBD: create a property-version (as against label) of the same thing.\n",
    "    #Vishnu: 21 Jun 2022: created this f() to create relationships with usecase label\n",
    "    #if this works, this is the only function that needed to be called.\n",
    "    def create_actors_relationship_with_usecase(self, actor1_name, rel_name, actor2_name, usecase_id):\n",
    "            #process actor1\n",
    "            self.create_node_with_usecase_label(actor1_name, usecase_id)\n",
    "            #process actor2\n",
    "            self.create_node_with_usecase_label(actor2_name, usecase_id)\n",
    "            #process relation\n",
    "            self.create_rel_with_usecase_label(actor1_name, rel_name, actor2_name, usecase_id)\n",
    "\n",
    "    #Vishnu: 23 June 2022: created\n",
    "    #looks for a rel under a use case between 2 given nodes.\n",
    "    #normally, we expect only 0 or 1 unique entry.\n",
    "    @staticmethod                \n",
    "    def _find_and_return_this_existing_rels(tx, actor1_name, rel_name, actor2_name, usecase_id):\n",
    "        query = (\n",
    "            \"MATCH (n1)-[r1]-(n2) \"\n",
    "            \"WHERE (n1.name ='\" + actor1_name + \"') \"\n",
    "            \"and   (n2.name ='\" + actor2_name + \"') \"\n",
    "            \"and   (r1.usecase CONTAINS '\"+ usecase_id+ \"') \"\n",
    "            \"and   (r1.name ='\" + rel_name + \"') \"\n",
    "            \"RETURN n1.name as n1name, r1.name as r1name, n2.name as n2name, r1.usecase as r1usecase\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        return [row[\"r1name\"] for row in result]\n",
    "        \n",
    "    \n",
    "    #Vishnu: 21 June 2022: created this supporting f()\n",
    "    #return for all relationship between given two nodes.\n",
    "    @staticmethod                \n",
    "    def _find_and_return_all_existing_rels_for_uc(tx, actor1_name, actor2_name, usecase_id):\n",
    "        query = (\n",
    "            \"MATCH (n1)-[r1]-(n2) \"\n",
    "            \"WHERE (n1.name ='\" + actor1_name + \"') \"\n",
    "            \"and   (n2.name ='\" + actor2_name + \"') \"\n",
    "            \"and   (r1.usecase CONTAINS '\"+ usecase_id+ \"') \"\n",
    "            \"RETURN n1.name as n1name, r1.name as r1name, n2.name as n2name, r1.usecase as r1usecase\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        try:\n",
    "            return [{\n",
    "                        \"n1name\": row[\"n1name\"],\n",
    "                        \"n2name\": row[\"n2name\"],\n",
    "                        \"r1name\": row[\"r1name\"],\n",
    "                        \"r1usecase\": row[\"r1usecase\"],\n",
    "                    } \n",
    "                    for row in result]\n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "\n",
    "    #Vishnu: 21 June 2022: created this supporting f()\n",
    "    #adds a name for an existing relationship between given two nodes.\n",
    "    @staticmethod                \n",
    "    def _add_usecase_and_return_existing_rel(tx, actor1_name, rel_name, actor2_name, usecase_id):\n",
    "        query = (\n",
    "            \"MATCH (n1)-[r1]-(n2) \"\n",
    "            \"WHERE (n1.name ='\" + actor1_name + \"') \"\n",
    "            \"and   (n2.name ='\" + actor2_name + \"')\"\n",
    "            \"set    r1.usecase = r1.usecase + '\" + \",\" + \"'\"+ \"+ '\"+usecase_id +\"' \"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "\n",
    "    \n",
    "    #Vishnu: 30 june 2022: created\n",
    "    #CAUTION: if the property already exists, \n",
    "    #this overwrites the current value.\n",
    "    @staticmethod\n",
    "    def _write_property_and_return_existing_node(tx, actor_name, propertyName, propertyVal):\n",
    "        query = (\n",
    "            \"MATCH \"\n",
    "            \"(n1) \"\n",
    "            \"WHERE n1.name = '\" + actor_name +\"' \"\n",
    "            \"set n1.\"+propertyName+\" = '\"+propertyVal +\"' \"\n",
    "            \"return n1\"\n",
    "        )\n",
    "        result = tx.run(query, actor_name=actor_name)\n",
    "        try:\n",
    "            return [{\"n1\": row[\"n1\"][\"name\"]}\n",
    "                    for row in result]\n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "\n",
    "    #Vishnu: 30 june 2022: created\n",
    "    #CAUTION: if the property already exists, \n",
    "    #this overwrites the current value.\n",
    "    @staticmethod\n",
    "    def _write_property_and_return_existing_rel(tx, actor1_name, rel_name, actor2_name, \n",
    "                                                propertyName, propertyVal):\n",
    "        query = (\n",
    "            \"MATCH (n1)-[r1]-(n2) \"\n",
    "            \"WHERE (n1.name ='\" + actor1_name + \"') \"\n",
    "            \"and   (n2.name ='\" + actor2_name + \"') \"\n",
    "            \"and   (r1.name ='\" + rel_name + \"') \"\n",
    "            \"set   r1.\"+propertyName+\" = '\"+propertyVal +\"' \"\n",
    "            \"return r1\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        try:\n",
    "            return [{\"r1\": row[\"r1\"][\"name\"]}\n",
    "                    for row in result]\n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "\n",
    "    #Vishnu: 22 June 2022: created\n",
    "    #assumption: nodes already exist\n",
    "    @staticmethod\n",
    "    def _create_and_return_rel(tx, actor1_name, rel_name, actor2_name, usecaseid):\n",
    "            query = (\n",
    "            \"MATCH \"\n",
    "            \"(n1), \"\n",
    "            \"(n2) \"\n",
    "            \"WHERE n1.name = '\" + actor1_name + \"' AND n2.name = '\"+actor2_name+\"' \"\n",
    "            \" AND n1.usecase CONTAINS '\"+ usecaseid+\"' \"\n",
    "            \" AND n2.usecase CONTAINS '\"+ usecaseid+\"' \"\n",
    "            \"CREATE (n1)-[r1:Relation \" + \"{name: '\"+rel_name+\"', usecase: '\"+usecaseid+\"'} ]->(n2) \"\n",
    "            \"RETURN n1, r1, n2\"\n",
    "            )\n",
    "            result = tx.run(query)\n",
    "            try:\n",
    "                return [{\"n1name\": row[\"n1\"][\"name\"], \n",
    "                        \"r1name\": row[\"r1\"][\"name\"],\n",
    "                        \"n2name\": row[\"n2\"][\"name\"],\n",
    "                        \"r1usecase\": row[\"r1\"][\"usecase\"]}\n",
    "                        for row in result]\n",
    "            # Capture any errors along with the query and data for traceability\n",
    "            except ServiceUnavailable as exception:\n",
    "                logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                    query=query, exception=exception))\n",
    "                raise\n",
    "\n",
    "    #Vishnu: 1 Jun 2022: created this f() to list all nodes with usecase label\n",
    "    def find_all_usecase_actors(self, usecase_id):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.read_transaction(self._find_and_return_all_usecase_actors, usecase_id)\n",
    "            i=0\n",
    "            for row in result:\n",
    "                i=i+1\n",
    "                print(\"Found actor-\"+ str(i) +\": {row}\".format(row=row))\n",
    "\n",
    "    @staticmethod\n",
    "    def _find_and_return_all_usecase_actors(tx, usecase_id):\n",
    "        query = (\n",
    "            \"MATCH (n) \"\n",
    "            \"WHERE (n.usecase = '\"+usecase_id+\"') \"\n",
    "            \"RETURN n.name AS name\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        return [row[\"name\"] for row in result]\n",
    "\n",
    "    #Vishnu: 21 Jun 2022: created this f() to cleanup the DB\n",
    "    #CAUTION: will delete everything\n",
    "    def cleanup_db(self):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.read_transaction(\n",
    "                self._count_nodes_in_db)\n",
    "            for row in result:\n",
    "                print(\"Found {row} actors, deleting! \".format(row=row['count']))\n",
    "            result = session.write_transaction(\n",
    "                self._cleanup_db)\n",
    "\n",
    "    #Vishnu: 22 June 2022: created this f() \n",
    "    #(over)writes a prop to a node\n",
    "    def writePropToNode(self, actor_name, propertyName, propertyVal):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(\n",
    "                self._write_property_and_return_existing_node, \n",
    "                    actor_name, \n",
    "                    propertyName, \n",
    "                    propertyVal)\n",
    "        \n",
    "            # we expect only 1 node. Do we need the for loop below?\n",
    "            for row in result:\n",
    "                print(\"added prop \"+\n",
    "                        propertyName+\n",
    "                        \" = \"+\n",
    "                        propertyVal+\n",
    "                        \" to node: {n1}\".format(n1=row['n1']))\n",
    "\n",
    "    #Vishnu: 22 June 2022: created this f() \n",
    "    #(over)writes a prop to a rel\n",
    "    def writePropToRel(self, a1, rel_name, a2, propertyName, propertyVal):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(\n",
    "                self._write_property_and_return_existing_rel, \n",
    "                    a1, rel_name, a2,\n",
    "                    propertyName, \n",
    "                    propertyVal)\n",
    "        \n",
    "            # we expect only 1 node. Do we need the for loop below?\n",
    "            for row in result:\n",
    "                print(\"added prop \"+\n",
    "                        propertyName+\n",
    "                        \" = \"+\n",
    "                        propertyVal+\n",
    "                        \" to rel: {r1}\".format(r1=row['r1']))\n",
    "\n",
    "    @staticmethod\n",
    "    def _cleanup_db(tx):\n",
    "        query = (\n",
    "            \"MATCH (n) \"\n",
    "            \"detach delete n\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        try:\n",
    "            return \n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "\n",
    "    @staticmethod\n",
    "    def _count_nodes_in_db(tx):\n",
    "        query = (\n",
    "            \"MATCH (n) \"\n",
    "            \"return count(n) as count\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        try:\n",
    "            return [{\"count\": row[\"count\"]} \n",
    "                    for row in result]\n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "            \n",
    "            \n",
    "    ################################################################################################   \n",
    "    \"\"\"\n",
    "    Link prediction functions by Tarek:\n",
    "    \"\"\"\n",
    "    ################################################################################################\n",
    "\n",
    "    @staticmethod\n",
    "    def _creat_projection(tx, proj):\n",
    "        query = (\n",
    "            \"CALL gds.graph.project('\" + proj +\"', '*', {Relation: {orientation: 'UNDIRECTED'}}) \"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "    \n",
    "    def project(self):\n",
    "         with self.driver.session() as session:\n",
    "            result = session.write_transaction(\n",
    "                self._creat_projection)\n",
    "\n",
    "    @staticmethod\n",
    "    def _make_pipe(tx, pipe):\n",
    "        query = (\n",
    "            \"CALL gds.beta.pipeline.linkPrediction.create('\" +pipe+ \"') \"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        \n",
    "    @staticmethod\n",
    "    def _add_node_props(tx, pipe, prop, config):\n",
    "        query = (\n",
    "            \"CALL gds.beta.pipeline.linkPrediction.addNodeProperty('\" +pipe+  \"', '\" +prop+ \"',\" +config+ \") YIELD nodePropertySteps \"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        \n",
    "    @staticmethod\n",
    "    def _add_link_feat(tx, pipe, feature, config):\n",
    "        query = (\n",
    "            \"CALL gds.beta.pipeline.linkPrediction.addFeature('\" +pipe+ \"', '\"+feature+\"' , \"+config+\") YIELD featureSteps; \"\n",
    "        )\n",
    "        \n",
    "        \n",
    "        result = tx.run(query)\n",
    "    \n",
    "    @staticmethod\n",
    "    def _split_data(tx, pipe):\n",
    "        query = (\n",
    "            \"CALL gds.beta.pipeline.linkPrediction.configureSplit('\"+ pipe+ \"\"\"',\n",
    "            { testFraction: 0.20, trainFraction: 0.80, negativeSamplingRatio: 1.0}) YIELD splitConfig;   \n",
    "            \"\"\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "    \n",
    "    @staticmethod    \n",
    "    def _add_model_cands(tx, pipe, param):\n",
    "        query = (\n",
    "            \"CALL gds.alpha.pipeline.linkPrediction.addRandomForest('\"+ pipe+\"', \"+param+\") YIELD parameterSpace; \" \n",
    "        )\n",
    "        result = tx.run(query)\n",
    "    \n",
    "    @staticmethod\n",
    "    def _train_model(tx, proj, pipe):\n",
    "        query = (\n",
    "            \"CALL gds.beta.pipeline.linkPrediction.train('\" +proj+ \"', { pipeline: '\"+pipe+ \"\"\"',\n",
    "            modelName: 'rf-pipeline-model3',  concurrency: 1, randomSeed: 99 }) YIELD modelInfo  \n",
    "            RETURN modelInfo.bestParameters AS winningModel, modelInfo.metrics.AUCPR.train.avg AS avgTrainScore,\n",
    "            modelInfo.metrics.AUCPR.outerTrain AS outerTrainScore, modelInfo.metrics.AUCPR.test AS testScore \n",
    "            \"\"\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        try:\n",
    "            return [{\"winningModel\": row[\"winningModel\"], \n",
    "                     \"avgTrainScore\": row[\"avgTrainScore\"],\n",
    "                    \"outerTrainScore\": row[\"outerTrainScore\"],\n",
    "                    \"testScore\": row[\"testScore\"]} for row in result]\n",
    "        # Capture any errors along with the query and data for traceability\n",
    "        except ServiceUnavailable as exception:\n",
    "            logging.error(\"{query} raised an error: \\n {exception}\".format(\n",
    "                query=query, exception=exception))\n",
    "            raise\n",
    "            \n",
    "    def LinkPrediction(self, proj, pipe, props, config_n, features, config_f, model_params):\n",
    "        with self.driver.session() as session:\n",
    "            session.write_transaction(self._creat_projection, proj)\n",
    "            session.write_transaction(self._make_pipe, pipe)\n",
    "            \n",
    "            for i in range(len(props)):\n",
    "                session.write_transaction(self._add_node_props, pipe, props[i], config_n[i])\n",
    "                \n",
    "            for i in range(len(features)):\n",
    "                session.write_transaction(self._add_link_feat,pipe, features[i], config_f[i])\n",
    "            \n",
    "            session.write_transaction(self._split_data, pipe)\n",
    "            \n",
    "            for i in range(len(model_params)):\n",
    "                session.write_transaction(self._add_model_cands, pipe, model_params[i])   \n",
    "                \n",
    "            result = session.write_transaction(self._train_model, proj ,pipe)\n",
    "        print(result)\n",
    "        \n",
    "    @staticmethod\n",
    "    def _predict_rels(tx, proj, model_name):\n",
    "        query = (\n",
    "            \"CALL gds.beta.pipeline.linkPrediction.predict.mutate('\"+proj+\"', { modelName: '\"+model_name+\"', mutateRelationshipType: 'Predicted_Relation', threshold: 0.95,  topN: 10, concurrency: 1, randomSeed:20}) YIELD relationshipsWritten, samplingStats\"\n",
    "            \" Return relationshipsWritten, samplingStats\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        return [{\"relationshipsWritten\": row[\"relationshipsWritten\"], \n",
    "                     \"samplingStats\": row[\"samplingStats\"] } for row in result]\n",
    "        \n",
    "    def predict(self, proj, model_name):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._predict_rels, proj, model_name)\n",
    "                \n",
    "        print(result)\n",
    "            \n",
    "    @staticmethod\n",
    "    def _drop_model(tx, model):\n",
    "        query = (\n",
    "            \"CALL gds.beta.model.drop('\"+model+\"')\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        \n",
    "    def drop_model(self, model):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._drop_model, model)\n",
    "            \n",
    "    @staticmethod\n",
    "    def _drop_proj(tx, proj):\n",
    "        query = (\n",
    "            \"CALL gds.graph.drop('\"+proj+\"')\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        \n",
    "    def drop_proj(self, proj):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._drop_proj, proj)\n",
    "            \n",
    "    @staticmethod\n",
    "    def _drop_pipe(tx, pipe):\n",
    "        query = (\n",
    "            \"CALL gds.beta.pipeline.drop('\"+pipe+\"')\"\n",
    "        )\n",
    "        result = tx.run(query)\n",
    "        \n",
    "    def drop_pipe(self, pipe):\n",
    "        with self.driver.session() as session:\n",
    "            result = session.write_transaction(self._drop_pipe, pipe)\n",
    "        "
   ]
  },
  {
   "cell_type": "markdown",
   "id": "82fdf865",
   "metadata": {},
   "source": [
    "# Creating connection and importing relations:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "124b674f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created node: Knowledge base\n",
      "Created node: AN component-N\n",
      "Created relation: Knowledge base - exchange of knowledge - AN component-N in UC001\n",
      "Created node: AN Component-1\n",
      "Node already exists: AN component-N in ['UC001']\n",
      "ignoring ...\n",
      "Created relation: AN Component-1 - exchange of knowledge - AN component-N in UC001\n",
      "Node already exists: Knowledge base in ['UC001']\n",
      "ignoring ...\n",
      "Node already exists: AN Component-1 in ['UC001']\n",
      "ignoring ...\n",
      "Created relation: Knowledge base - Report - AN Component-1 in UC001\n",
      "Node already exists: Knowledge base in ['UC001']\n",
      "ignoring ...\n",
      "Node already exists: AN Component-1 in ['UC001']\n",
      "ignoring ...\n",
      "Created relation: Knowledge base - exchange of knowledge - AN Component-1 in UC001\n",
      "Created node: Management domain\n",
      "Node already exists: Knowledge base in ['UC001']\n",
      "ignoring ...\n",
      "Created relation: Management domain - import of knowledge - Knowledge base in UC001\n",
      "Node already exists: Management domain in ['UC001']\n",
      "ignoring ...\n",
      "Node already exists: Knowledge base in ['UC001']\n",
      "ignoring ...\n",
      "Created relation: Management domain - Report - Knowledge base in UC001\n",
      "Node already exists: Knowledge base in ['UC001']\n",
      "ignoring ...\n",
      "Node already exists: AN component-N in ['UC001']\n",
      "ignoring ...\n",
      "Created relation: Knowledge base - Report - AN component-N in UC001\n",
      "Node already exists: Knowledge base in ['UC001']\n",
      "ignoring ...\n",
      "Created node: Network service within domain\n",
      "Created relation: Knowledge base - exchange of knowledge - Network service within domain in UC001\n",
      "Node already exists: Knowledge base in ['UC001']\n",
      "ignoring ...\n",
      "Created node: Network service outside the domain\n",
      "Created relation: Knowledge base - exchange of knowledge - Network service outside the domain in UC001\n",
      "Node already exists: AN Component-1 in ['UC001']\n",
      "adding label UC002 in addition to ['UC001']\n",
      "Created node: AN Sandbox\n",
      "Created relation: AN Component-1 - Trigger Experimentation - AN Sandbox in UC002\n",
      "Node already exists: AN component-N in ['UC001']\n",
      "adding label UC002 in addition to ['UC001']\n",
      "Node already exists: AN Sandbox in ['UC002']\n",
      "ignoring ...\n",
      "Created relation: AN component-N - Trigger Experimentation - AN Sandbox in UC002\n",
      "Node already exists: AN component-N in ['UC001', 'UC002']\n",
      "ignoring ...\n",
      "Node already exists: AN Sandbox in ['UC002']\n",
      "ignoring ...\n",
      "Trigger Experimentation already exists with UC002 between AN component-N and AN Sandbox\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002']\n",
      "ignoring ...\n",
      "Node already exists: AN Sandbox in ['UC002']\n",
      "ignoring ...\n",
      "Created relation: AN Component-1 - Report on Experimentation - AN Sandbox in UC002\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002']\n",
      "ignoring ...\n",
      "Node already exists: Knowledge base in ['UC001']\n",
      "adding label UC002 in addition to ['UC001']\n",
      "Created relation: AN Component-1 - Update knowledge - Knowledge base in UC002\n",
      "Created node: AN component-2|human\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002']\n",
      "adding label UC003 in addition to ['UC001', 'UC002']\n",
      "Created relation: AN component-2|human - Peer feedback - AN Component-1 in UC003\n",
      "Node already exists: AN component-2|human in ['UC003']\n",
      "ignoring ...\n",
      "Node already exists: Knowledge base in ['UC001', 'UC002']\n",
      "adding label UC003 in addition to ['UC001', 'UC002']\n",
      "Created relation: AN component-2|human - Update knowledge - Knowledge base in UC003\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003']\n",
      "ignoring ...\n",
      "Node already exists: AN component-2|human in ['UC003']\n",
      "ignoring ...\n",
      "Created relation: AN Component-1 - Update knowledge - AN component-2|human in UC003\n",
      "Created node: Controller\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003']\n",
      "adding label UC004 in addition to ['UC001', 'UC002', 'UC003']\n",
      "Created relation: Controller - Instantiate closed loop instances - AN Component-1 in UC004\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003', 'UC004']\n",
      "ignoring ...\n",
      "Node already exists: Knowledge base in ['UC001', 'UC002', 'UC003']\n",
      "adding label UC004 in addition to ['UC001', 'UC002', 'UC003']\n",
      "Created relation: AN Component-1 - Update knowledge - Knowledge base in UC004\n",
      "Node already exists: Controller in ['UC004']\n",
      "ignoring ...\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003', 'UC004']\n",
      "ignoring ...\n",
      "Created relation: Controller - Capability discovery - AN Component-1 in UC004\n",
      "Node already exists: Controller in ['UC004']\n",
      "ignoring ...\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003', 'UC004']\n",
      "ignoring ...\n",
      "Created relation: Controller - Configure closed loop instances - AN Component-1 in UC004\n",
      "Node already exists: Controller in ['UC004']\n",
      "ignoring ...\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003', 'UC004']\n",
      "ignoring ...\n",
      "Created relation: Controller - Closed loop monitoring - AN Component-1 in UC004\n",
      "Created node: AN\n",
      "Created node: Industry vertical solution provider\n",
      "Created relation: AN - Intent + configuration - Industry vertical solution provider in UC010\n",
      "Node already exists: Industry vertical solution provider in ['UC010']\n",
      "ignoring ...\n",
      "Created node: Service LCM\n",
      "Created relation: Industry vertical solution provider - Triggers - Service LCM in UC010\n",
      "Node already exists: AN in ['UC010']\n",
      "ignoring ...\n",
      "Node already exists: Industry vertical solution provider in ['UC010']\n",
      "ignoring ...\n",
      "Created relation: AN - Abstracted interface - Industry vertical solution provider in UC010\n",
      "Created node: Industry vertical applications\n",
      "Node already exists: AN in ['UC010']\n",
      "ignoring ...\n",
      "Created relation: Industry vertical applications - Technology specific APIs - AN in UC010\n",
      "Created node: Network services\n",
      "Node already exists: AN in ['UC010']\n",
      "ignoring ...\n",
      "Created relation: Network services - Technology specific APIs - AN in UC010\n",
      "Node already exists: AN Sandbox in ['UC002']\n",
      "adding label UC010 in addition to ['UC002']\n",
      "Node already exists: AN in ['UC010']\n",
      "ignoring ...\n",
      "Created relation: AN Sandbox - Experimentation - AN in UC010\n",
      "Node already exists: Industry vertical applications in ['UC010']\n",
      "ignoring ...\n",
      "Node already exists: AN in ['UC010']\n",
      "ignoring ...\n",
      "Created relation: Industry vertical applications - Monitoring - AN in UC010\n",
      "Node already exists: Network services in ['UC010']\n",
      "ignoring ...\n",
      "Node already exists: AN in ['UC010']\n",
      "ignoring ...\n",
      "Created relation: Network services - Monitoring - AN in UC010\n",
      "Node already exists: AN in ['UC010']\n",
      "ignoring ...\n",
      "Node already exists: Industry vertical solution provider in ['UC010']\n",
      "ignoring ...\n",
      "Created relation: AN - Reports - Industry vertical solution provider in UC010\n",
      "Node already exists: AN in ['UC010']\n",
      "ignoring ...\n",
      "Node already exists: Industry vertical solution provider in ['UC010']\n",
      "ignoring ...\n",
      "Created relation: AN - Recipes - Industry vertical solution provider in UC010\n",
      "Created node: End-user communities\n",
      "Node already exists: Industry vertical solution provider in ['UC010']\n",
      "adding label UC011 in addition to ['UC010']\n",
      "Created relation: End-user communities - Manage community needs for connectivity - Industry vertical solution provider in UC011\n",
      "Node already exists: AN in ['UC010']\n",
      "adding label UC011 in addition to ['UC010']\n",
      "Node already exists: Industry vertical solution provider in ['UC010', 'UC011']\n",
      "ignoring ...\n",
      "Created relation: AN - Abstracted interface - Industry vertical solution provider in UC011\n",
      "Node already exists: End-user communities in ['UC011']\n",
      "ignoring ...\n",
      "Node already exists: AN in ['UC010', 'UC011']\n",
      "ignoring ...\n",
      "Created relation: End-user communities - Manage shared network connectivity - AN in UC011\n",
      "Created node: Industry vertical applications @ edge\n",
      "Node already exists: AN in ['UC010', 'UC011']\n",
      "ignoring ...\n",
      "Created relation: Industry vertical applications @ edge - Runtime onboarding of apps - AN in UC011\n",
      "Node already exists: AN in ['UC010', 'UC011']\n",
      "ignoring ...\n",
      "Node already exists: Industry vertical solution provider in ['UC010', 'UC011']\n",
      "ignoring ...\n",
      "Created relation: AN - Single window monitoring - Industry vertical solution provider in UC011\n",
      "Node already exists: End-user communities in ['UC011']\n",
      "ignoring ...\n",
      "Node already exists: Industry vertical applications @ edge in ['UC011']\n",
      "ignoring ...\n",
      "Created relation: End-user communities - Network connectivity option-1 - Industry vertical applications @ edge in UC011\n",
      "Node already exists: End-user communities in ['UC011']\n",
      "ignoring ...\n",
      "Node already exists: Industry vertical applications @ edge in ['UC011']\n",
      "ignoring ...\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created relation: End-user communities - Network connectivity option-2 - Industry vertical applications @ edge in UC011\n",
      "Node already exists: End-user communities in ['UC011']\n",
      "ignoring ...\n",
      "Node already exists: Industry vertical applications @ edge in ['UC011']\n",
      "ignoring ...\n",
      "Created relation: End-user communities - Network connectivity option-3 - Industry vertical applications @ edge in UC011\n",
      "Node already exists: End-user communities in ['UC011']\n",
      "ignoring ...\n",
      "Node already exists: AN in ['UC010', 'UC011']\n",
      "ignoring ...\n",
      "Created relation: End-user communities - Manage end-user onboarding, management, billing, etc - AN in UC011\n",
      "Created node: NAO @ edge\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003', 'UC004']\n",
      "adding label UC020 in addition to ['UC001', 'UC002', 'UC003', 'UC004']\n",
      "Created relation: NAO @ edge - Closed loop report based on abstracted network and app state - AN Component-1 in UC020\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003', 'UC004', 'UC020']\n",
      "ignoring ...\n",
      "Node already exists: AN Sandbox in ['UC002', 'UC010']\n",
      "adding label UC020 in addition to ['UC002', 'UC010']\n",
      "Created relation: AN Component-1 - Trigger specific-app digital twins/simulators for ex - AN Sandbox in UC020\n",
      "Created node: Private 5G deployment @ edge\n",
      "Node already exists: NAO @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Created relation: Private 5G deployment @ edge - Design network deployment architecture - NAO @ edge in UC020\n",
      "Node already exists: Private 5G deployment @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Node already exists: NAO @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Created relation: Private 5G deployment @ edge - Design application deployment - NAO @ edge in UC020\n",
      "Node already exists: Private 5G deployment @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Node already exists: NAO @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Created relation: Private 5G deployment @ edge - Design closed loops @ edge - NAO @ edge in UC020\n",
      "Node already exists: Private 5G deployment @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Node already exists: NAO @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Created relation: Private 5G deployment @ edge - Closed loops Report - NAO @ edge in UC020\n",
      "Node already exists: NAO @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003', 'UC004', 'UC020']\n",
      "ignoring ...\n",
      "Created relation: NAO @ edge - Design closed loop @ edge, based on abstracted network and app state - AN Component-1 in UC020\n",
      "Node already exists: NAO @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Node already exists: AN Component-1 in ['UC001', 'UC002', 'UC003', 'UC004', 'UC020']\n",
      "ignoring ...\n",
      "Created relation: NAO @ edge - App recipes and network design recipes for edge report based on abstracted network and app state - AN Component-1 in UC020\n",
      "Node already exists: Private 5G deployment @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Node already exists: NAO @ edge in ['UC020']\n",
      "ignoring ...\n",
      "Created relation: Private 5G deployment @ edge - App recipes and network design recipes for edge - NAO @ edge in UC020\n",
      "Created node: Backend\n",
      "Created node: Intelligent maintenance assistance system\n",
      "Created relation: Backend - Evolution of analysis - Intelligent maintenance assistance system in UC029\n",
      "Node already exists: Intelligent maintenance assistance system in ['UC029']\n",
      "ignoring ...\n",
      "Created node: 3rd party developer\n",
      "Created relation: Intelligent maintenance assistance system - Create novel apps using SDK - 3rd party developer in UC029\n",
      "Created node: Intelligent AR app\n",
      "(Glasses)\n",
      "Node already exists: Backend in ['UC029']\n",
      "ignoring ...\n",
      "Created relation: Intelligent AR app\n",
      "(Glasses) - Automated collection of data - Backend in UC029\n",
      "Node already exists: Intelligent AR app\n",
      "(Glasses) in ['UC029']\n",
      "ignoring ...\n",
      "Node already exists: Backend in ['UC029']\n",
      "ignoring ...\n",
      "Created relation: Intelligent AR app\n",
      "(Glasses) - Automated rendering of service assistance - Backend in UC029\n",
      "Node already exists: Intelligent AR app\n",
      "(Glasses) in ['UC029']\n",
      "ignoring ...\n",
      "Node already exists: Backend in ['UC029']\n",
      "ignoring ...\n",
      "Created relation: Intelligent AR app\n",
      "(Glasses) - Evolution of data collection - Backend in UC029\n",
      "Node already exists: Backend in ['UC029']\n",
      "ignoring ...\n",
      "Node already exists: Intelligent maintenance assistance system in ['UC029']\n",
      "ignoring ...\n",
      "Created relation: Backend - Query regarding maintainance [data + alarms] - Intelligent maintenance assistance system in UC029\n",
      "Created node: human\n",
      "Node already exists: Intelligent maintenance assistance system in ['UC029']\n",
      "ignoring ...\n",
      "Created relation: human - Creating reports for humans - Intelligent maintenance assistance system in UC029\n",
      "Created node: OpenCN (repo)\n",
      "Created node: AN orchestrator\n",
      "Created relation: OpenCN (repo) - Composition service towards the edge - AN orchestrator in UC030\n",
      "Created node: NAO\n",
      "Node already exists: AN orchestrator in ['UC030']\n",
      "ignoring ...\n",
      "Created relation: NAO - AN intent [app abstracted] - AN orchestrator in UC030\n",
      "Node already exists: AN orchestrator in ['UC030']\n",
      "ignoring ...\n",
      "Node already exists: NAO @ edge in ['UC020']\n",
      "adding label UC030 in addition to ['UC020']\n",
      "Created relation: AN orchestrator - Existing controller characteristics [metadata] - NAO @ edge in UC030\n",
      "Node already exists: NAO in ['UC030']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030']\n",
      "ignoring ...\n",
      "Created relation: NAO - edge controller characteristics - AN orchestrator in UC030\n",
      "Node already exists: AN orchestrator in ['UC030']\n",
      "ignoring ...\n",
      "Node already exists: NAO @ edge in ['UC020', 'UC030']\n",
      "ignoring ...\n",
      "Created relation: AN orchestrator - Deploy controllers towards the edge - NAO @ edge in UC030\n",
      "Node already exists: NAO in ['UC030']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030']\n",
      "ignoring ...\n",
      "Created relation: NAO - Monitoring reports - AN orchestrator in UC030\n",
      "Node already exists: OpenCN (repo) in ['UC030']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030']\n",
      "ignoring ...\n",
      "Created relation: OpenCN (repo) - Controller upload - AN orchestrator in UC030\n",
      "Created node: Controller designer\n",
      "Node already exists: AN orchestrator in ['UC030']\n",
      "adding label UC031 in addition to ['UC030']\n",
      "Created relation: Controller designer - Controller intent - AN orchestrator in UC031\n",
      "Node already exists: AN Sandbox in ['UC002', 'UC010', 'UC020']\n",
      "adding label UC031 in addition to ['UC002', 'UC010', 'UC020']\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031']\n",
      "ignoring ...\n",
      "Created relation: AN Sandbox - Experimentation - AN orchestrator in UC031\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031']\n",
      "ignoring ...\n",
      "Created node: CL automation framework\n",
      "Created relation: AN orchestrator - Controller download - CL automation framework in UC031\n",
      "Node already exists: OpenCN (repo) in ['UC030']\n",
      "adding label UC031 in addition to ['UC030']\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031']\n",
      "ignoring ...\n",
      "Created relation: OpenCN (repo) - Controller upload - AN orchestrator in UC031\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031']\n",
      "ignoring ...\n",
      "Created relation: OpenCN (repo) - Module query - AN orchestrator in UC031\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031']\n",
      "ignoring ...\n",
      "Controller upload already exists with UC031 between OpenCN (repo) and AN orchestrator\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031']\n",
      "ignoring ...\n",
      "Controller upload already exists with UC031 between OpenCN (repo) and AN orchestrator\n",
      "Node already exists: Controller designer in ['UC031']\n",
      "adding label UC032 in addition to ['UC031']\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031']\n",
      "adding label UC032 in addition to ['UC030', 'UC031']\n",
      "Created relation: Controller designer - Intent based design, composition and Ev of coltrollers - OpenCN (repo) in UC032\n",
      "Node already exists: AN Sandbox in ['UC002', 'UC010', 'UC020', 'UC031']\n",
      "adding label UC032 in addition to ['UC002', 'UC010', 'UC020', 'UC031']\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031']\n",
      "adding label UC032 in addition to ['UC030', 'UC031']\n",
      "Created relation: AN Sandbox - Experimentation::model new games, level of trust, strategies - AN orchestrator in UC032\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031', 'UC032']\n",
      "ignoring ...\n",
      "Node already exists: CL automation framework in ['UC031']\n",
      "adding label UC032 in addition to ['UC031']\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created relation: AN orchestrator - Learn new classes of players, strategies and equilibrium - CL automation framework in UC032\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031', 'UC032']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031', 'UC032']\n",
      "ignoring ...\n",
      "Created relation: OpenCN (repo) - Model initial game and players - AN orchestrator in UC032\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031', 'UC032']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031', 'UC032']\n",
      "ignoring ...\n",
      "Created relation: OpenCN (repo) - Controller upload - AN orchestrator in UC032\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031', 'UC032']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031', 'UC032']\n",
      "ignoring ...\n",
      "Created relation: OpenCN (repo) - Trust grades are established - AN orchestrator in UC032\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031', 'UC032']\n",
      "ignoring ...\n",
      "Node already exists: AN orchestrator in ['UC030', 'UC031', 'UC032']\n",
      "ignoring ...\n",
      "Created relation: OpenCN (repo) - Controller Ev and adaptations - AN orchestrator in UC032\n",
      "Created node: Workflow manager\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031', 'UC032']\n",
      "adding label UC033 in addition to ['UC030', 'UC031', 'UC032']\n",
      "Created relation: Workflow manager - Read, compile and store compiled controller specifications - OpenCN (repo) in UC033\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031', 'UC032', 'UC033']\n",
      "ignoring ...\n",
      "Created node: Anatomy engine\n",
      "Created relation: OpenCN (repo) - Create and store controller specifications - Anatomy engine in UC033\n",
      "Node already exists: Workflow manager in ['UC033']\n",
      "ignoring ...\n",
      "Created node: Workflow mediator\n",
      "Created relation: Workflow manager - Select workflow manager - Workflow mediator in UC033\n",
      "Node already exists: Workflow mediator in ['UC033']\n",
      "ignoring ...\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031', 'UC032', 'UC033']\n",
      "ignoring ...\n",
      "Created relation: Workflow mediator - Read controller specifications - OpenCN (repo) in UC033\n",
      "Created node: Ex manager\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031', 'UC032', 'UC033']\n",
      "ignoring ...\n",
      "Created relation: Ex manager - Trigger experimentation on compiled controllers - OpenCN (repo) in UC033\n",
      "Created node: Deployment manager\n",
      "Node already exists: OpenCN (repo) in ['UC030', 'UC031', 'UC032', 'UC033']\n",
      "ignoring ...\n",
      "Created relation: Deployment manager - Trigger deployment on compiled controllers - OpenCN (repo) in UC033\n",
      "Node already exists: Controller designer in ['UC031', 'UC032']\n",
      "adding label UC035 in addition to ['UC031', 'UC032']\n",
      "Node already exists: AN in ['UC010', 'UC011']\n",
      "adding label UC035 in addition to ['UC010', 'UC011']\n",
      "Created relation: Controller designer - Intent based design, composition and Ev of coltrollers - AN in UC035\n",
      "Created node: FLAML controller\n",
      "Created node: ML layer\n",
      "Created relation: FLAML controller - Application of ML parameters, observations, monitoring - ML layer in UC035\n",
      "Node already exists: FLAML controller in ['UC035']\n",
      "ignoring ...\n",
      "Node already exists: AN in ['UC010', 'UC011', 'UC035']\n",
      "ignoring ...\n",
      "Created relation: FLAML controller - Coordination, feedback - AN in UC035\n",
      "Node already exists: FLAML controller in ['UC035']\n",
      "ignoring ...\n",
      "Node already exists: AN in ['UC010', 'UC011', 'UC035']\n",
      "ignoring ...\n",
      "Created relation: FLAML controller - Application of ML intent or Controller - AN in UC035\n",
      "Node already exists: AN in ['UC010', 'UC011', 'UC035']\n",
      "ignoring ...\n",
      "Node already exists: Controller designer in ['UC031', 'UC032', 'UC035']\n",
      "ignoring ...\n",
      "Created relation: AN - Coordination, feedback - Controller designer in UC035\n",
      "Created node: BS2\n",
      "Created node: BS1\n",
      "Created relation: BS2 - heavy increase in number of users - BS1 in UC037\n",
      "Node already exists: BS2 in ['UC037']\n",
      "ignoring ...\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Created relation: BS2 - Predefined agreement with BS2 to provide coverage for BS1 users - BS1 in UC037\n",
      "Node already exists: BS2 in ['UC037']\n",
      "ignoring ...\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Created relation: BS2 - Loaded maximum capacity - BS1 in UC037\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Created node: BS3\n",
      "Created relation: BS1 - send message to share network/expand coverage agreement - BS3 in UC037\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Created node: BS4\n",
      "Created relation: BS1 - send message to share network/expand coverage agreement - BS4 in UC037\n",
      "Node already exists: BS3 in ['UC037']\n",
      "ignoring ...\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Created relation: BS3 - response with supported SLA offer - BS1 in UC037\n",
      "Node already exists: BS4 in ['UC037']\n",
      "ignoring ...\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Created relation: BS4 - response with supported SLA offer - BS1 in UC037\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Node already exists: BS3 in ['UC037']\n",
      "ignoring ...\n",
      "Created relation: BS1 - updated shared agreement request - BS3 in UC037\n",
      "Node already exists: BS3 in ['UC037']\n",
      "ignoring ...\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Created relation: BS3 - updated shared agreement response - BS1 in UC037\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Node already exists: BS3 in ['UC037']\n",
      "ignoring ...\n",
      "Created relation: BS1 - terminate shared agreement request(include billing details) - BS3 in UC037\n",
      "Node already exists: BS3 in ['UC037']\n",
      "ignoring ...\n",
      "Node already exists: BS1 in ['UC037']\n",
      "ignoring ...\n",
      "Created relation: BS3 - terminate shared agreement response - BS1 in UC037\n",
      "Created node: AN_1\n",
      "Created node: Operations team\n",
      "Created relation: AN_1 - notification to respective team to configure the equipment - Operations team in UC038\n",
      "Node already exists: AN_1 in ['UC038']\n",
      "ignoring ...\n",
      "Created node: Inventory systems\n",
      "Created relation: AN_1 - Equipment purchase order request - Inventory systems in UC038\n",
      "Node already exists: AN Sandbox in ['UC002', 'UC010', 'UC020', 'UC031', 'UC032']\n",
      "adding label UC038 in addition to ['UC002', 'UC010', 'UC020', 'UC031', 'UC032']\n",
      "Node already exists: AN_1 in ['UC038']\n",
      "ignoring ...\n",
      "Created relation: AN Sandbox - test report response - AN_1 in UC038\n",
      "Node already exists: AN Sandbox in ['UC002', 'UC010', 'UC020', 'UC031', 'UC032', 'UC038']\n",
      "ignoring ...\n",
      "Node already exists: AN_1 in ['UC038']\n",
      "ignoring ...\n",
      "Created relation: AN Sandbox - updated shared agreement response - AN_1 in UC038\n",
      "Node already exists: Inventory systems in ['UC038']\n",
      "ignoring ...\n",
      "Node already exists: AN_1 in ['UC038']\n",
      "ignoring ...\n",
      "Created relation: Inventory systems - Equipment purchase order response(local storage) - AN_1 in UC038\n",
      "Node already exists: Operations team in ['UC038']\n",
      "ignoring ...\n",
      "Node already exists: AN Sandbox in ['UC002', 'UC010', 'UC020', 'UC031', 'UC032', 'UC038']\n",
      "ignoring ...\n",
      "Created relation: Operations team - configuration of equipment like cabling, power up, connectivity - AN Sandbox in UC038\n",
      "Node already exists: Operations team in ['UC038']\n",
      "ignoring ...\n",
      "Node already exists: AN_1 in ['UC038']\n",
      "ignoring ...\n",
      "Created relation: Operations team - notification response - AN_1 in UC038\n",
      "Node already exists: AN_1 in ['UC038']\n",
      "ignoring ...\n",
      "Node already exists: AN Sandbox in ['UC002', 'UC010', 'UC020', 'UC031', 'UC032', 'UC038']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - start automated test request - AN Sandbox in UC038\n",
      "Node already exists: AN_1 in ['UC038']\n",
      "ignoring ...\n",
      "Node already exists: Operations team in ['UC038']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - Deploy equipment request - Operations team in UC038\n",
      "Node already exists: Operations team in ['UC038']\n",
      "ignoring ...\n",
      "Node already exists: AN_1 in ['UC038']\n",
      "ignoring ...\n",
      "Created relation: Operations team - deploy equipment response - AN_1 in UC038\n",
      "Node already exists: Controller in ['UC004']\n",
      "adding label UC039 in addition to ['UC004']\n",
      "Node already exists: AN_1 in ['UC038']\n",
      "adding label UC039 in addition to ['UC038']\n",
      "Created relation: Controller - check the availability of control loop - AN_1 in UC039\n",
      "Node already exists: Controller in ['UC004', 'UC039']\n",
      "ignoring ...\n",
      "Created node: Controller repository\n",
      "Created relation: Controller - check the availability of control loop - Controller repository in UC039\n",
      "Node already exists: AN Sandbox in ['UC002', 'UC010', 'UC020', 'UC031', 'UC032', 'UC038']\n",
      "adding label UC039 in addition to ['UC002', 'UC010', 'UC020', 'UC031', 'UC032', 'UC038']\n",
      "Node already exists: Controller in ['UC004', 'UC039']\n",
      "ignoring ...\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Created relation: AN Sandbox - evaluation results of control loop apps - Controller in UC039\n",
      "Node already exists: Controller repository in ['UC039']\n",
      "ignoring ...\n",
      "Node already exists: Controller in ['UC004', 'UC039']\n",
      "ignoring ...\n",
      "Created relation: Controller repository - availability response(details of control loop(could be more than one) like size, features, requirements) - Controller in UC039\n",
      "Node already exists: AN_1 in ['UC038', 'UC039']\n",
      "ignoring ...\n",
      "Node already exists: Controller in ['UC004', 'UC039']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - negative response - Controller in UC039\n",
      "Node already exists: Controller in ['UC004', 'UC039']\n",
      "ignoring ...\n",
      "Node already exists: Controller repository in ['UC039']\n",
      "ignoring ...\n",
      "Created relation: Controller - Command to download the selected control loop apps in a sandbox environment - Controller repository in UC039\n",
      "Created node: AN_2\n",
      "Node already exists: AN_1 in ['UC038', 'UC039']\n",
      "adding label UC040 in addition to ['UC038', 'UC039']\n",
      "Created relation: AN_2 - Discovery of AN is prerequisite - AN_1 in UC040\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Created node: AN_3\n",
      "Created relation: AN_1 - AN_1 sends request to other reachable AN to offload traffic - AN_3 in UC040\n",
      "Node already exists: AN_3 in ['UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_3 - response with capability SLA - AN_1 in UC040\n",
      "Node already exists: AN_2 in ['UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_2 - context release response(include billing request as per SLA) - AN_1 in UC040\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_2 in ['UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - AN_1 deconfigures the networks underlays - AN_2 in UC040\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_2 in ['UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - context release request - AN_2 in UC040\n",
      "Node already exists: AN_3 in ['UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_3 - Discovery of AN is prerequisite - AN_1 in UC040\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_2 in ['UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - AN_1 sends request to other reachable AN to offload traffic - AN_2 in UC040\n",
      "Node already exists: AN_2 in ['UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_2 - response with capability SLA - AN_1 in UC040\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_3 in ['UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - negative acknowledgement for the unicast reply - AN_3 in UC040\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_2 in ['UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - Configuration and context setup request required to handle the offload traffic  - AN_2 in UC040\n",
      "Node already exists: AN_2 in ['UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_2 - context setup response - AN_1 in UC040\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_2 in ['UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - AN_1 configures the network underlays for routing, policing up to AN_2 - AN_2 in UC040\n",
      "Node already exists: AN_1 in ['UC038', 'UC039', 'UC040']\n",
      "ignoring ...\n",
      "Node already exists: AN_2 in ['UC040']\n",
      "ignoring ...\n",
      "Created relation: AN_1 - AN_1  pays AN_2 for the service - AN_2 in UC040\n",
      "added prop capability = Optimization to node: Management domain\n",
      "added prop capability = Trials, selection of learners, hyperparameters to node: FLAML controller\n",
      "added prop capability = Serving users (BS1 and BS2) to node: BS2\n",
      "added prop capability = Continuous monitoring equipment , Successfully replaced the faulty equipment, Serving traffic/requests, Heavy burst of traffic, The control loop Identifies the lack of computing and storage to serve the requests and maintain the desired quality of services, Control loop evaluates the responses from AN_2 and AN_3 based on its requirements, Serving maximum traffics, reduced traffic load, The control loop Identifies the reduced traffic load and generate resource release request to AN_2 and underlays network to node: AN_1\n",
      "added prop capability = The control loop identifies the need to replace faulty equipment, Continuous monitoring of new equipment , Evaluate and select one to deploy, Evaluate different control loops based on requirements and select(one or multiple) for download from store to node: Controller\n",
      "added prop capability = Decide scenarios for experimentation, Adjust AN behavior, Decide AN behavior, Evolution for edge based on abstracted network and app state and knowledge to node: AN Component-1\n",
      "added prop capability = Analysis of edge capabilities and app requirements, Ev-a-s: e.g. Genetic algo, Controller composition, Controller evolution to node: AN orchestrator\n",
      "added prop capability = Monitor and analyze the experimentation, Testing of equipment and generate test results, Configure and test apps, Monitor behavior of apps per SLA and generate results for evaluation to node: AN Sandbox\n",
      "added prop capability = Configures and deploy the equipment to node: Operations team\n",
      "added prop capability = provide equipment details fro local storage or place a purchase order to node: Inventory systems\n",
      "added prop capability = Serving offloaded traffic to node: AN_2\n",
      "added prop capability = onboard preloaded tasks to node: Workflow manager\n",
      "added prop capability = Serving BS1 users to node: BS3\n",
      "added prop capability = Serving users, The control loop identifies the need to expand coverage via other base stations, The control loop prepares the agreement with required SLA for broadcast, Evaluate the offers and prepare updated agreement, The control loop identifies the reduced load to node: BS1\n",
      "added prop capability = Automated analysis using AI/ML to node: Backend\n",
      "added prop capability = Selection of controllers and underlays to node: AN\n"
     ]
    }
   ],
   "source": [
    "# Adding new nodes usnig Reference code My edition:\n",
    "for i, row in relations.iterrows():\n",
    "    app.create_actors_relationship_with_usecase(row[\"source\"], row[\"message\"],\n",
    "                                                row[\"target\"], row[\"id\"])\n",
    "# importing functions:\n",
    "import json\n",
    "\n",
    "with open(\"funcs.json\") as f:\n",
    "    funcs = json.loads(f.read())\n",
    "    \n",
    "for func in funcs:\n",
    "    if funcs[func] in edits:\n",
    "        funcs[func] = edits[funcs[func]]\n",
    "# create json object from dictionary\n",
    "funcs['Monitor and analyze the experimentation'] = 'AN Sandbox'\n",
    "json = json.dumps(funcs)\n",
    "\n",
    "# open file for writing, \"w\" \n",
    "f = open(\"newfuncs.json\",\"w\")\n",
    "\n",
    "# write json object to file\n",
    "f.write(json)\n",
    "\n",
    "# close file\n",
    "f.close()\n",
    "comps_w_funcs = {}\n",
    "\n",
    "comps = set(funcs.values())\n",
    "for comp in comps:\n",
    "    comps_w_funcs[comp]=[]\n",
    "    for f in funcs:\n",
    "        if funcs[f] == comp:\n",
    "            comps_w_funcs[comp].append(f)\n",
    "for c in comps_w_funcs:\n",
    "    str_ = \", \".join(comps_w_funcs[c])\n",
    "    app.writePropToNode(c, \"capability\", str_)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3804784c",
   "metadata": {},
   "source": [
    "# Training and predicting:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 154,
   "id": "83ef8422",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'winningModel': {'maxDepth': 15, 'minSplitSize': 2, 'numberOfDecisionTrees': 2, 'methodName': 'RandomForest', 'numberOfSamplesRatio': 0.9}, 'avgTrainScore': 0.9171934400236287, 'outerTrainScore': 0.932149751792609, 'testScore': 0.8890819535884231}]\n"
     ]
    }
   ],
   "source": [
    "## Making link prediction:\n",
    "props = [\"fastRP\", 'degree', 'labelPropagation']\n",
    "conf_n = [\"{ mutateProperty: 'embedding', embeddingDimension: 64, randomSeed: 20}\", \n",
    "          \"{ mutateProperty: 'degree' }\", \n",
    "         \"{mutateProperty: 'community'}\"]\n",
    "\n",
    "features = ['l2', 'cosine', 'l2', \"l2\"]\n",
    "config_f = [\"{ nodeProperties: ['embedding'] }\" ,\n",
    "            \"{ nodeProperties: ['embedding']}\"  ,\n",
    "            \"{ nodeProperties: ['degree'] }\"    , \n",
    "            \"{ nodeProperties: ['community'] }\"]\n",
    "\n",
    "model_params = ['{numberOfDecisionTrees: 2, maxDepth: 15, numberOfSamplesRatio: 0.9}',\n",
    "                \"{numberOfDecisionTrees: 5, maxDepth: 100 , numberOfSamplesRatio: 0.5}\"]\n",
    "\n",
    "app.drop_model('rf-pipeline-model3')\n",
    "app.drop_proj('proj95')\n",
    "app.drop_pipe('pipe95')\n",
    "app.LinkPrediction(\"proj95\", \"pipe95\", props, \n",
    "                   conf_n, features, config_f,\n",
    "                   model_params)\n",
    "\n",
    "#Export prjected Grpah\n",
    "# CALL gds.graph.export(\"proj95\", {dbName: \"preditedGrpah\"})\n",
    "# :use system;\n",
    "# CREATE DATABASE preditedGrpah;\n",
    "\n",
    "# :use preditedGrpah\n",
    "# MATCH (n) RETURN n;"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 157,
   "id": "098ca231",
   "metadata": {},
   "outputs": [],
   "source": [
    "uri = \"bolt://localhost:7687\"\n",
    "user = \"neo4j\"\n",
    "password = \"123\"\n",
    "app = App(uri, user, password)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "c29097f3",
   "metadata": {},
   "outputs": [],
   "source": [
    "# app.cleanup_db()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 158,
   "id": "b5fbf15a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[{'relationshipsWritten': 20, 'samplingStats': {'linksConsidered': 936, 'strategy': 'exhaustive'}}]\n"
     ]
    }
   ],
   "source": [
    "app.predict('proj95', 'rf-pipeline-model3')"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
